tests/Fixtures/invoice.json

{
    "data": {
        "id": "b76f81ec-3e8d-4342-aacb-582fab083660",
        "business_name": "Crypto Accounting LLC",
        "resource": "invoice",
        "code": "BV9KGDVA",
        "status": "OPEN",
        "customer_name": "Test Customer",
        "customer_email": "customer@test.com",
        "local_price": {
            "amount": "100.00",
            "currency": "USD"
        },
        "memo": "Taxes and Accounting Services",
        "hosted_url": "https://commerce.coinbase.com/invoices/BV9KGDVA",
        "created_at": "2021-01-12T21:38:24Z",
        "updated_at": "2021-01-12T21:38:24Z"
    }
}