tests/Fixtures/invoiceList.json

{
    "pagination": {
        "order": "desc",
        "starting_after": null,
        "ending_before": null,
        "total": 9,
        "limit": 2,
        "yielded": 2,
        "cursor_range": [
            "488fcbd5-eb82-42dc-8a2b-10fdf70e0bfe",
            "e1506c50-835b-46af-9ee5-b9edd4032b26"
        ],
        "previous_uri": "https://api.commerce.coinbase.com/charges?ending_before=488fcbd5-eb82-42dc-8a2b-10fdf70e0bfe&limit=2",
        "next_uri": "https://api.commerce.coinbase.com/charges?limit=2&starting_after=e1506c50-835b-46af-9ee5-b9edd4032b26"
    },
    "data": [
        {
            "id": "b76f81ec-3e8d-4342-aacb-582fab083660",
            "business_name": "Crypto Accounting LLC",
            "resource": "invoice",
            "code": "BV9KGDVA",
            "status": "OPEN",
            "customer_name": "Test Customer",
            "customer_email": "customer@test.com",
            "local_price": {
                "amount": "100.00",
                "currency": "USD"
            },
            "memo": "Taxes and Accounting Services",
            "hosted_url": "https://commerce.coinbase.com/invoices/BV9KGDVA",
            "created_at": "2021-01-12T21:38:24Z",
            "updated_at": "2021-01-12T21:38:24Z"
        },
        {
            "id": "d0bb39fc-3690-4c88-bb41-74ca60b77df0",
            "resource": "invoice",
            "code": "8LA8E2WX",
            "status": "VIEWED",
            "business_name": "Crypto Accounting LLC",
            "customer_name": "Test Customer",
            "customer_email": "customer@test.com",
            "memo": "Accounting and tax consultation services",
            "local_price": {
                "amount": "50.00",
                "currency": "USD"
            },
            "hosted_url": "https://commerce.coinbase.com/invoices/8LA8E2WX",
            "created_at": "2021-01-12T21:06:42Z",
            "updated_at": "2021-01-12T21:07:58Z"
        }
    ]
}